# Created by Rohit Chaturvedi

##### Topic Covered :- Pandas (In Details)

##### Date :- 21st of July 2021

### Contents 

* What is Pandas 
* Importing Pandas Library 
* Pandas Series 
* Pandas DataFrame
* Filtering 
* Adding/Removing Rows and Columns
* Merging Dataframes
* Sorting 
* Aggregation Functions 
* Grouping or Group By
* Apply 
* Pivot Tables
* Missing Values (NaN)
* Working with External Files in Pandas.

## Resources to Learn Pandas

### Introduction to Pandas / Getting Started with Pandas


* https://www.datacamp.com/courses/pandas-foundations
* https://www.w3resource.com/python-exercises/pandas/index.php
* https://www.kaggle.com/learn/pandas
* https://nbviewer.jupyter.org/github/fonnesbeck/Bios8366/blob/master/notebooks/Section2_1-Introduction-to-Pandas.ipynb

### What is Pandas ?

* Pandas is a software library written for the Python programming language for data manipulation and analysis.
* Pandas is an open source Python package that is most widely used for data science/data analysis and machine learning       tasks.
* It is built on top of another package named Numpy, which provides support for multi-dimensional arrays.


#### You can Install Pandas Library from Here :- https://pandas.pydata.org/

### Importing Pandas Library 

* First and Foremost you need to have Pandas Library Downloaded in your system.

In [1]:
import pandas as pd # Here we are importing Pandas Library as pd. pd is alias name given to Pandas Library.

* Now after Importing the Pandas Library. 
* We have to dig in deeper in Pandas Library.

* The most widely used Pandas Data Structures are the Series and the DataFrame.
  Simply, a Series is similar to a single column of data, 
  while a DataFrame is similar to a sheet with rows and columns.

### What is Pandas Series?

* In Simple terms, Series is nothing but 1D Array. 

* Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.).

* Pandas Series is nothing but a column in an excel sheet.

#### Creating Pandas Series 

* Series in Pandas returns both Values and Indexes associated with it.

In [3]:
ser = pd.Series([10,29,40,199,73])

In [4]:
ser

0     10
1     29
2     40
3    199
4     73
dtype: int64

* Checking the Type of ser Variable

In [5]:
type(ser)

pandas.core.series.Series

* Series.axes attribute returns a list of row axis labels of the given Series object.

* Basically in Simple language it tells us about how many rows we have in our series.

In [6]:
ser.axes

[RangeIndex(start=0, stop=5, step=1)]

* Checking the DataType of the Series.

In [9]:
ser.dtype

dtype('int64')

* Series.size :- Size attribute returns the number of elements in the underlying data for the given series objects.

* It basically gives total number of elements in our series.

In [10]:
ser.size # Total Number of Elements in series.

5

##### Checking the Dimension of the Series.

* To check the Dimension of the Series ?

* ndim attribute returns the number of dimensions of the underlying data, by definition it is 1 for series objects.          
* Syntax:Series.ndim

In [12]:
ser.ndim # Tell us about the dimension of the series,.

1

#### Series.values 
* Series.values attribute return Series as ndarray or ndarray-like depending on the dtype.

* If we want to view values inside our series then we can use Series.values.

In [13]:
ser.values

array([ 10,  29,  40, 199,  73], dtype=int64)

 * If we want to view only 2 elements of the series
 
 * In this Case we use Series.head()

In [14]:
ser.head(2) # 2 is the element which we want to see.

0    10
1    29
dtype: int64

* Now If we want to see the last elements of our Series of Last Couple of Series.

* In this case we can use Series.tail()

In [15]:
ser.tail(2)

3    199
4     73
dtype: int64

* We can also use indexing to access the indiviual elements from the series.

In [16]:
ser[3] # Accessing the 4th Element of the Series.

199

#### Changing/Setting Index Labels

* Creating  a new Series.

In [17]:
art = pd.Series([11,12,13,14,15,1, 2,3,5,6,9])

In [18]:
art

0     11
1     12
2     13
3     14
4     15
5      1
6      2
7      3
8      5
9      6
10     9
dtype: int64

##### Specifying the Index Values

* Giving Index Values of the element of the series.

In [21]:
art = pd.Series([11,12,13,14,15,1,2,3,5,6,9], index = [2,4,9,7,5,0,1,3,6,10,11]) # We can specify the Indexes.

In [27]:
art # Without Sorting the Series Elements.

2     11
4     12
9     13
7     14
5     15
0      1
1      2
3      3
6      5
10     6
11     9
dtype: int64

* Now if we want to sort it into the proper valid index then we can use sort_index().

In [29]:
art.sort_index() # Elements After Sorting the Elements.

0      1
1      2
2     11
3      3
4     12
5     15
6      5
7     14
9     13
10     6
11     9
dtype: int64

* We can also specify our Indexes in Strings/Objects.

In [31]:
new_art = pd.Series([1,2,4,5,6],index = ["First","Zero","Second","Third","Fourth"])

In [34]:
new_art #Series with String Indexes.

First     1
Zero      2
Second    4
Third     5
Fourth    6
dtype: int64

##### Note :- If we are using the string based indexes and if we run sort_index() throughout the series, Then it will arrange the Series elements on the basis of alphabetically (A to Z).

In [39]:
new_art.sort_index()

First     1
Fourth    6
Second    4
Third     5
Zero      2
dtype: int64

### Creating Series with Dictionaries

* We can also use Dictionary to create series.

In [40]:
ages = {'Andrew':31,"Kate":45,"Matthew":26,"Helen":19}

In [42]:
new_ages = pd.Series(ages)

In [43]:
new_ages

Andrew     31
Kate       45
Matthew    26
Helen      19
dtype: int64

* If we only want to select a Particular elements from the dictionary then we can use index.

In [44]:
pd.Series(ages,index =["Andrew","Helen"])

Andrew    31
Helen     19
dtype: int64

#### Creating Pandas Series by Numpy Arrays

In [45]:
import numpy as np

* We can also create series using numpy.

In [46]:
art_new = np.array([1,2,3,4])

In [47]:
art_new

array([1, 2, 3, 4])

* We can also convert a 1D Array to Series.

In [49]:
pd.Series(art_new)

0    1
1    2
2    3
3    4
dtype: int32

#### Merging Two Series (Concatenation)

In [50]:
a =pd.Series([0,2,4,6,8,10])
b = pd.Series([1,3,5,7,9,11])

In [51]:
c =pd.concat([a,b]) # Series after Concatenation.

In [52]:
c

0     0
1     2
2     4
3     6
4     8
5    10
0     1
1     3
2     5
3     7
4     9
5    11
dtype: int64

#### Selection in Pandas Series

* In this Section we are going to see if how can we can use selection and use different selectors to select specific elements from the Series.

In [53]:
liz = pd.Series([11,12,13,14,15,16])

In [54]:
liz

0    11
1    12
2    13
3    14
4    15
5    16
dtype: int64

In [55]:
liz[1]

12

In [56]:
liz[2]

13

In [57]:
liz[0]

11

In [60]:
liz[0:3] # Here we are slicing the elements and select elements only based from there index numbers.

0    11
1    12
2    13
dtype: int64

In [62]:
liz[3:] #Selecting Elements only from Index 3 to Last.

3    14
4    15
5    16
dtype: int64

* Here we can also use the string indexes to give indexes.

* If we want to see only the index values then we can use Series.index

In [65]:
liz.index

RangeIndex(start=0, stop=6, step=1)

* If we only want to see the keys values only then we can use Series.keys.

In [69]:
liz.keys

<bound method Series.keys of 0    11
1    12
2    13
3    14
4    15
5    16
dtype: int64>

* If we want to see the values with respect to there keys values then we use Series.items() function.

In [73]:
ca =list(liz.items())

In [74]:
ca # Here we can see that the values appread with there index values.

[(0, 11), (1, 12), (2, 13), (3, 14), (4, 15), (5, 16)]

#### Fancy Elements Selecting in Pandas

In [95]:
san = pd.Series([1,2,3,4,5,6,7,8])

In [96]:
san

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

* Suppose if we only want index 3 and 5 from the entire Series.

In [98]:
san[[3,5]]

3    4
5    6
dtype: int64

* We can also do Fancy elements using string indexes.

In [99]:
san = pd.Series([1,2,3,4,5], index = ['First','Second','Third','Fourth','Fifth'])

In [100]:
san

First     1
Second    2
Third     3
Fourth    4
Fifth     5
dtype: int64

* Now suppose if we want element first and fifth from the Series elements.

In [103]:
san[['First','Fifth']]

First    1
Fifth    5
dtype: int64

#### Updating Values in Pandas

In [104]:
new_ser = pd.Series([10,20,30,40,50])

In [105]:
new_ser

0    10
1    20
2    30
3    40
4    50
dtype: int64

* Now suppose if we want to change value of index 2 from 30 to 45.

In [106]:
new_ser[2] = 45

In [107]:
new_ser

0    10
1    20
2    45
3    40
4    50
dtype: int64

#### Pandas Dataframes
* What is Dataframe ?

* In simple terms, A DataFrame is 2D Array consisting of Rows and Columns.

* Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

* Creating a DataFrame

In [110]:
names = {"Names":["Allen","Rob","Harold","Amy"],"Age":[21,11,13,15]} # Dictionary of Names.

# Creating a DataFrame using a Dictionary.

new_dic = pd.DataFrame(names)

In [112]:
new_dic #Created our First DataFrame

    Names  Age
0   Allen   21
1     Rob   11
2  Harold   13
3     Amy   15

##### Think of the Keys as Columns and Values as Rows

* If we want to see a specific columns from a DataFrame :-

In [113]:
#Suppose I want to see only Age column from the DataFrame :- 

new_dic["Age"]

0    21
1    11
2    13
3    15
Name: Age, dtype: int64

* We can also access the column through this method.

In [114]:
new_dic.Age

0    21
1    11
2    13
3    15
Name: Age, dtype: int64

* We can also Assign Column name in this way.

In [116]:
variables = [10,30,20,89,48,40]
df = pd.DataFrame(variables,columns = ["Variables"])

In [117]:
df

   Variables
0         10
1         30
2         20
3         89
4         48
5         40

In [119]:
import numpy as np

* We can also create DataFrames from Numpy.

In [122]:
arr = np.random.randint(10,size = (5,2)) # OR we can do this :- np.array([1,2,3,4]).reshape(2,2)
arr

array([[5, 0],
       [6, 3],
       [8, 0],
       [2, 2],
       [8, 0]])

* We can assign them the columns name also.

In [127]:
new_arr= pd.DataFrame(arr,columns = ["Var1","Var2"])

In [128]:
new_arr

   Var1  Var2
0     5     0
1     6     3
2     8     0
3     2     2
4     8     0

##### Attributes of a Dataframe

In [129]:
new_arr # So we have a DataFrame new_arr.

   Var1  Var2
0     5     0
1     6     3
2     8     0
3     2     2
4     8     0

* DataFrame.axes attribute access a group of rows and columns by label(s) or a boolean array in the given DataFrame.

In [130]:
new_arr.axes

[RangeIndex(start=0, stop=5, step=1), Index(['Var1', 'Var2'], dtype='object')]

* Shape :- To check the dimension of the DataFrame.

In [133]:
new_arr.shape # We have 5 rows and 2 columns

(5, 2)

* Checking the Dimension of the DataFrame

In [135]:
new_arr.ndim

2

* Size :- Checking the total number of elements in the DataFrame

In [136]:
new_arr.size

10

* Columns :-  Getting the Columns Names from the DataFrame

In [137]:
new_arr.columns

Index(['Var1', 'Var2'], dtype='object')

* Index :- The index (row labels) of the DataFrame.

* It basically tells us that how many rows  our DataFrame has.

In [138]:
new_arr.index

RangeIndex(start=0, stop=5, step=1)

* Values :- DataFrame.values attribute return a Numpy representation of the given DataFrame.

* Basically it list down the Values from the DataFrame

In [139]:
new_arr.values

array([[5, 0],
       [6, 3],
       [8, 0],
       [2, 2],
       [8, 0]])

#### Changing Column Names in DataFrame

In [140]:
new_arr

   Var1  Var2
0     5     0
1     6     3
2     8     0
3     2     2
4     8     0

In [142]:
new_arr.columns

Index(['Var1', 'Var2'], dtype='object')

In [143]:
new_arr.columns = ("Variable 1","Variable 2")

In [144]:
new_arr

   Variable 1  Variable 2
0           5           0
1           6           3
2           8           0
3           2           2
4           8           0

#### Accessing the rows of the DataFrame

In [161]:
dfc = pd.DataFrame({"Name":["Josh","Rachel","Tim","Kate","Zach","Andrew"],"Age":[11,13,16,12,14,18],
                    "Salary":[10000,23000,18000,3900000,19000,24000]})

In [162]:
dfc

     Name  Age   Salary
0    Josh   11    10000
1  Rachel   13    23000
2     Tim   16    18000
3    Kate   12  3900000
4    Zach   14    19000
5  Andrew   18    24000

In [163]:
dfc.Age

0    11
1    13
2    16
3    12
4    14
5    18
Name: Age, dtype: int64

* Now if we want to access the rows specific :-

In [164]:
dfc["Age"][3] # Accessing the Age of the 4th element from the DataFrame

12

#### Assigning a Value to a Specific Row

In [165]:
dfc

     Name  Age   Salary
0    Josh   11    10000
1  Rachel   13    23000
2     Tim   16    18000
3    Kate   12  3900000
4    Zach   14    19000
5  Andrew   18    24000

* So here we are accessing the DataFrame using the iloc and loc and change the values of the DataFrame.

In [166]:
dfc.iloc[2] = ["Ron",15,185] # Here we are assigning new values to a specific row.

In [167]:
dfc

     Name  Age   Salary
0    Josh   11    10000
1  Rachel   13    23000
2     Ron   15      185
3    Kate   12  3900000
4    Zach   14    19000
5  Andrew   18    24000

##### Assigning Custom Indexes.

In [168]:
dfc

     Name  Age   Salary
0    Josh   11    10000
1  Rachel   13    23000
2     Ron   15      185
3    Kate   12  3900000
4    Zach   14    19000
5  Andrew   18    24000

* First we had to add a column for making the custom indexes.

In [169]:
roll_no = [112890,39080,18878,38788,9070,50830]

* Adding the Roll Number Column in dfc DataFrame.

In [183]:
dfc["Roll Number"] = roll_no

In [184]:
dfc

               Name  Age   Salary  Roll Number
Roll Number
112890         Josh   11    10000       112890
39080        Rachel   13    23000        39080
18878           Ron   15      185        18878
38788          Kate   12  3900000        38788
9070           Zach   14    19000         9070
50830        Andrew   18    24000        50830

* Now Setting the Index on the Basis of Roll Number

In [185]:
dfc.set_index("Roll Number",inplace = True) # Inplace = True means make the changes in the existing table now.

In [186]:
dfc

               Name  Age   Salary
Roll Number
112890         Josh   11    10000
39080        Rachel   13    23000
18878           Ron   15      185
38788          Kate   12  3900000
9070           Zach   14    19000
50830        Andrew   18    24000

* Now Suppose if we want to locate any record or row based on roll number we can do that using the loc[] function.

In [188]:
dfc.loc[9070] # Located the roll number 9070 and it's information.

Name       Zach
Age          14
Salary    19000
Name: 9070, dtype: object

##### Resetting the Indexes

In [189]:
dfc

               Name  Age   Salary
Roll Number
112890         Josh   11    10000
39080        Rachel   13    23000
18878           Ron   15      185
38788          Kate   12  3900000
9070           Zach   14    19000
50830        Andrew   18    24000

* Now if you want to reset the index back, Then we use reset_index() function.

In [190]:
dfc.reset_index(inplace=True)

In [191]:
dfc

   Roll Number    Name  Age   Salary
0       112890    Josh   11    10000
1        39080  Rachel   13    23000
2        18878     Ron   15      185
3        38788    Kate   12  3900000
4         9070    Zach   14    19000
5        50830  Andrew   18    24000

##### Sorting Indexes

* So here we are inserting the indexes values in the dfc DataFrame.

In [195]:
dfc = pd.DataFrame({"Name":["Josh","Rachel","Tim","Kate","Zach","Andrew"],"Age":[11,13,16,12,14,18],
                    "Salary":[10000,23000,18000,3900000,19000,24000]},index = [1,89,39,36,78,54])

In [196]:
dfc

      Name  Age   Salary
1     Josh   11    10000
89  Rachel   13    23000
39     Tim   16    18000
36    Kate   12  3900000
78    Zach   14    19000
54  Andrew   18    24000

* Now if we want to sort these index values in ascending Order then we use sort_index()

In [197]:
dfc.sort_index(inplace=True)

In [198]:
dfc

      Name  Age   Salary
1     Josh   11    10000
36    Kate   12  3900000
39     Tim   16    18000
54  Andrew   18    24000
78    Zach   14    19000
89  Rachel   13    23000

### Filtering in DataFrame

In [199]:
employees = pd.DataFrame({"Name":["Josh","Mike","Julia","Sergio"],
                          "Department":["IT","Human Resources","Finance","Supply Chain"],
                          "Income":[4800,5200,6600,5700],
                          "Age":[24,28,33,41]})
employees

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41

* Now, if want to check according to Specific Department.

In [200]:
employees["Department"] == "IT"

0     True
1    False
2    False
3    False
Name: Department, dtype: bool

The result we obtained here in above statement is of Boolean Type. So to convert it into actual values we use:-

In [202]:
far = employees["Department"] == "IT" # This statement gives us the Index Values and in next statement we are converting it.

In [204]:
employees[far] # Actual Values Rather Than Boolean Values

   Name Department  Income  Age
0  Josh         IT    4800   24

We can also do this and it is more simpler and easy to look and Execute

In [205]:
employees[employees["Department"] == "IT"]

   Name Department  Income  Age
0  Josh         IT    4800   24

We can also use the loc[] Operator and it gives us the flexibility to choose from bretween various Departments

In [207]:
employees.loc[employees["Department"] == "IT","Name"]

0    Josh
Name: Name, dtype: object

##### Filtering with Arithmetic Types

In [ ]:
employees

* Now if we want to know the salary of the employees based on some arithmetic conditions

In [211]:
employees[employees["Income"] >5500]

     Name    Department  Income  Age
2   Julia       Finance    6600   33
3  Sergio  Supply Chain    5700   41

###### We use & in order to try 2 condition. This is and logic.

* In and (&) both Condition should be True, Then only you will get the result.

In [214]:
employees[(employees["Age"]>25) & (employees['Department'] == "Finance")]

    Name Department  Income  Age
2  Julia    Finance    6600   33

###### We use | in order to try 2 condition. This is or logic.

* In or (|) both condition should not be True, Even if One condition is True then also we can get the Result.

In [215]:
employees[(employees["Age"]>30) | (employees["Department"] == "HR")]

     Name    Department  Income  Age
2   Julia       Finance    6600   33
3  Sergio  Supply Chain    5700   41

##### Opposite Filter
* Wecan get Opposite of a filter using `(Tilde) sign.

In [216]:
employees

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41

So what Oppposite filter do is it reverses the condition that you are giving.

* Suppose for Example if you want employee that doesn't exceed age = 25 and if you put ~ (Tilde) Character in front of that 
 condition then it will show only that record which are over and above the age of 25 years.

In [228]:
employees[~(employees["Age"]<35)]

     Name    Department  Income  Age
3  Sergio  Supply Chain    5700   41

In [229]:
employees[~(employees["Income"]<5500)]

     Name    Department  Income  Age
2   Julia       Finance    6600   33
3  Sergio  Supply Chain    5700   41

##### Filtering with Filter () Function

In [230]:
employees

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41

In [231]:
employees.filter(items=["Department","Name","Income"])

        Department    Name  Income
0               IT    Josh    4800
1  Human Resources    Mike    5200
2          Finance   Julia    6600
3     Supply Chain  Sergio    5700

#### Adding/Removing  Rows and Columns

In [232]:
employees

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41

###### Adding Rows - append()

* Suppose Now I want to add values in Employees Table.

In [239]:
employees.append({"Name":"Romeo"},ignore_index=True)

     Name       Department  Income   Age
0    Josh               IT  4800.0  24.0
1    Mike  Human Resources  5200.0  28.0
2   Julia          Finance  6600.0  33.0
3  Sergio     Supply Chain  5700.0  41.0
4   Romeo              NaN     NaN   NaN

* It adds automatically to the end of dataframe. But we need to add all values, otherwise it gives nan.

In [247]:
employees.append({"Name":"Romeo","Age":26,"Department":"IT","Income":5500},ignore_index=True)

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41
4   Romeo               IT    5500   26

In [248]:
employees

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41

##### Removing Rows

* We can remove rows by Index.

In [249]:
employees.drop(index = 2)

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
3  Sergio     Supply Chain    5700   41

* We can also remove rows by conditions.

In [254]:
employees.drop(employees[employees["Age"]>30].index)

   Name       Department  Income  Age
0  Josh               IT    4800   24
1  Mike  Human Resources    5200   28

##### Adding Columns

In [255]:
employees

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41

* So here we are adding Experience Columns in our DatFrame.

In [258]:
employees["Experience"] = [1,3,4,7]

In [259]:
employees

     Name       Department  Income  Age  Experience
0    Josh               IT    4800   24           1
1    Mike  Human Resources    5200   28           3
2   Julia          Finance    6600   33           4
3  Sergio     Supply Chain    5700   41           7

##### Removing Columns

In [260]:
employees.drop(columns=["Experience"])

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41

In [263]:
employees.drop(columns=["Age","Experience"],axis =1) # Axis = 1 means Columns.

     Name       Department  Income
0    Josh               IT    4800
1    Mike  Human Resources    5200
2   Julia          Finance    6600
3  Sergio     Supply Chain    5700

#### Merging DataFrame

#####  Concat() Function

In [264]:
employees = pd.DataFrame({"Name":["Josh","Mike","Julia","Sergio"],
                          "Department":["IT","Human Resources","Finance","Supply Chain"],
                          "Income":[4800,5200,6600,5700],
                          "Age":[24,28,33,41]})

In [265]:
employees

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41

In [266]:
employees2 = pd.DataFrame({"Name":["Berkay","Michael","Christy","Feder"],
                          "Department":["Finance","Marketing","Human Resources","Law"],
                          "Income":[5700,6900,8700,6300],
                          "Age":[29,33,29,44]})

In [267]:
employees2

      Name       Department  Income  Age
0   Berkay          Finance    5700   29
1  Michael        Marketing    6900   33
2  Christy  Human Resources    8700   29
3    Feder              Law    6300   44

* We can Merge two or more DatFrame with concat() function.

In [268]:
pd.concat([employees,employees2]) # It will merge withoiut changing indexes.

      Name       Department  Income  Age
0     Josh               IT    4800   24
1     Mike  Human Resources    5200   28
2    Julia          Finance    6600   33
3   Sergio     Supply Chain    5700   41
0   Berkay          Finance    5700   29
1  Michael        Marketing    6900   33
2  Christy  Human Resources    8700   29
3    Feder              Law    6300   44

* To get Index in order and valid we use ignore_index = True.

In [274]:
pd.concat([employees,employees2],ignore_index =True) # It will Update Index.

      Name       Department  Income  Age
0     Josh               IT    4800   24
1     Mike  Human Resources    5200   28
2    Julia          Finance    6600   33
3   Sergio     Supply Chain    5700   41
4   Berkay          Finance    5700   29
5  Michael        Marketing    6900   33
6  Christy  Human Resources    8700   29
7    Feder              Law    6300   44

#### Joins

* Join is the concept coming from SQL. It helps us merging DataFrames.

* Types of Joins :- 
* i.) Inner Join :- Returns records that have matching values in both tables.
* ii.) Left Join :- Returns all the rows from the left table that are specified in the left outer join clause, not just the rows in which the columns match.
* iii.) Right Join :- Returns all records from the right table, and the matched records from the left table.
* iv.) Full Join :- Returns all records when there is a match in either left or right table.
* v.) Cross Join :- Returns all possible combinations of rows from two tables.

##### Inner Join

In [283]:
c1 = pd.DataFrame({"Name":['Amy','Allen','Alice','Anderson','Amanda'],"Age":[21,22,26,29,32],"Roll Number":[12,19,29,10,8]})

In [284]:
c1

       Name  Age  Roll Number
0       Amy   21           12
1     Allen   22           19
2     Alice   26           29
3  Anderson   29           10
4    Amanda   32            8

In [287]:
c2 =pd.DataFrame({"Marks":[90,89,82,98,85],"Roll Number":[1,90,29,48,67]})

In [288]:
c2

   Marks  Roll Number
0     90            1
1     89           90
2     82           29
3     98           48
4     85           67

* Here we are concatenating the the two DataFrame :- C1 & C2

In [289]:
pd.concat([c1,c2]) # Here we cans see that columns are not same and are matching.

       Name   Age  Roll Number  Marks
0       Amy  21.0           12    NaN
1     Allen  22.0           19    NaN
2     Alice  26.0           29    NaN
3  Anderson  29.0           10    NaN
4    Amanda  32.0            8    NaN
0       NaN   NaN            1   90.0
1       NaN   NaN           90   89.0
2       NaN   NaN           29   82.0
3       NaN   NaN           48   98.0
4       NaN   NaN           67   85.0

In [291]:
pd.concat([c1,c2],join= "inner") #Inner join just gets intersection of dataframes.

   Roll Number
0           12
1           19
2           29
3           10
4            8
0            1
1           90
2           29
3           48
4           67

* Here we cans see the column or record present both the dataframe get's selected in inner join.

##### Full Join :- Returns all records when there is a match in either left or right table.

In [293]:
pd.concat([c1,c2],join = "outer",ignore_index=True)

       Name   Age  Roll Number  Marks
0       Amy  21.0           12    NaN
1     Allen  22.0           19    NaN
2     Alice  26.0           29    NaN
3  Anderson  29.0           10    NaN
4    Amanda  32.0            8    NaN
5       NaN   NaN            1   90.0
6       NaN   NaN           90   89.0
7       NaN   NaN           29   82.0
8       NaN   NaN           48   98.0
9       NaN   NaN           67   85.0

##### Left Join :- Returns all the rows from the left table that are specified in the left outer join clause, not just the rows in which the columns match.

In [294]:
pd.merge(c1,c2,how ="left")

       Name  Age  Roll Number  Marks
0       Amy   21           12    NaN
1     Allen   22           19    NaN
2     Alice   26           29   82.0
3  Anderson   29           10    NaN
4    Amanda   32            8    NaN

##### Right Join :-  Returns all records from the right table, and the matched records from the left table.

In [296]:
pd.merge(c1,c2,how ="right")

    Name   Age  Roll Number  Marks
0    NaN   NaN            1     90
1    NaN   NaN           90     89
2  Alice  26.0           29     82
3    NaN   NaN           48     98
4    NaN   NaN           67     85

#### Append()
* We can also merge dataframes with append() function.

In [297]:
employees.append(employees2,ignore_index=True)

      Name       Department  Income  Age
0     Josh               IT    4800   24
1     Mike  Human Resources    5200   28
2    Julia          Finance    6600   33
3   Sergio     Supply Chain    5700   41
4   Berkay          Finance    5700   29
5  Michael        Marketing    6900   33
6  Christy  Human Resources    8700   29
7    Feder              Law    6300   44

##### Sorting

In [298]:
employees = pd.DataFrame({"Name":["Josh","Mike","Julia","Sergio","Julia"],
                          "Department":["IT","Human Resources","Finance","Supply Chain","Finance"],
                          "Income":[4800,5200,6600,5700,7200],
                          "Age":[24,28,33,41,22]})
employees

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41
4   Julia          Finance    7200   22

* Sorting the Values by Age.

In [300]:
employees.sort_values(by="Age") # Sorting the Employee DataFrame using the sort_values().

     Name       Department  Income  Age
4   Julia          Finance    7200   22
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41

* We can arrange index by :-

In [304]:
employees.sort_values(by="Age",ascending=False)

     Name       Department  Income  Age
3  Sergio     Supply Chain    5700   41
2   Julia          Finance    6600   33
1    Mike  Human Resources    5200   28
0    Josh               IT    4800   24
4   Julia          Finance    7200   22

In [309]:
employees.sort_values(by=["Name","Income"],ascending=False)

     Name       Department  Income  Age
3  Sergio     Supply Chain    5700   41
1    Mike  Human Resources    5200   28
4   Julia          Finance    7200   22
2   Julia          Finance    6600   33
0    Josh               IT    4800   24

* In order to get largest elements in a column, we can use **nlargest()** function.

In [314]:
employees["Income"].nlargest(2)

4    7200
2    6600
Name: Income, dtype: int64

* In order to get largest elements in a column, we can use **nsmallest()** function.

In [315]:
employees["Income"].nsmallest(2)

0    4800
1    5200
Name: Income, dtype: int64

#### Aggregation Functions

* Pandas has a number of aggregating functions that reduce the dimension of the grouped object.

* count()
* value_count()
* mean()
* median()
* sum() 
* min()
* max()
* std()
* var()
* describe()
* sem()

In [316]:
employees = pd.DataFrame({"Name":["Josh","Mike","Julia","Sergio","Julia","Michael","Sarath","Jakub","Chris"],
                          "Department":["IT","Human Resources","Finance","Supply Chain","Finance","Marketing","IT","Human Resources","Law"],
                          "Income":[4800,5200,6600,5700,7200,8400,7700,4200,9400],
                          "Age":[24,28,33,41,22,46,31,27,39],
                          "Experience":[2,5,9,17,1,24,10,6,13]})
employees

      Name       Department  Income  Age  Experience
0     Josh               IT    4800   24           2
1     Mike  Human Resources    5200   28           5
2    Julia          Finance    6600   33           9
3   Sergio     Supply Chain    5700   41          17
4    Julia          Finance    7200   22           1
5  Michael        Marketing    8400   46          24
6   Sarath               IT    7700   31          10
7    Jakub  Human Resources    4200   27           6
8    Chris              Law    9400   39          13

In [318]:
employees.count() # It count elements by elements.

Name          9
Department    9
Income        9
Age           9
Experience    9
dtype: int64

In [320]:
employees["Department"].value_counts() # It counts value in column

Finance            2
IT                 2
Human Resources    2
Marketing          1
Supply Chain       1
Law                1
Name: Department, dtype: int64

In [321]:
employees.mean() # Compute Mean of each column if it's numeric.

Income        6577.777778
Age             32.333333
Experience       9.666667
dtype: float64

In [323]:
employees["Income"].mean() # We can also compute mean of a specfic Column.

6577.777777777777

In [325]:
employees.median() # We can also compute median of Numeric Values

Income        6600.0
Age             31.0
Experience       9.0
dtype: float64

In [327]:
employees["Income"].sum() # Computing the sum of a specific Column.

59200

In [328]:
employees.min() # Compute minimum value of each Column.

Name            Chris
Department    Finance
Income           4200
Age                22
Experience          1
dtype: object

In [330]:
employees["Age"].min() # Computing the minimun value from the column Age of Employee DataFrame.

22

In [331]:
employees.max()

Name                Sergio
Department    Supply Chain
Income                9400
Age                     46
Experience              24
dtype: object

In [332]:
employees["Age"].max()

46

In [334]:
employees.std() # Compute Standard Deviation of each column if it's numeric.

Income        1746.981524
Age              8.154753
Experience       7.416198
dtype: float64

In [335]:
employees["Age"].std() # We can also compute values according to specific columns.

8.154753215150045

In [336]:
employees.var() # Computing the Varience.

Income        3.051944e+06
Age           6.650000e+01
Experience    5.500000e+01
dtype: float64

In [337]:
employees.describe() #It computes a quick summary of values per group if it's numeric.

            Income        Age  Experience
count     9.000000   9.000000    9.000000
mean   6577.777778  32.333333    9.666667
std    1746.981524   8.154753    7.416198
min    4200.000000  22.000000    1.000000
25%    5200.000000  27.000000    5.000000
50%    6600.000000  31.000000    9.000000
75%    7700.000000  39.000000   13.000000
max    9400.000000  46.000000   24.000000

In [338]:
employees.describe().T # We can Transpose it too, where rows become columns and columns become rows.

,count,mean,std,min,25%,50%,75%,max
Income,9.0,6577.777778,1746.981524,4200.0,5200.0,6600.0,7700.0,9400.0
Age,9.0,32.333333,8.154753,22.0,27.0,31.0,39.0,46.0
Experience,9.0,9.666667,7.416198,1.0,5.0,9.0,13.0,24.0

In [339]:
employees.sem() # It computes Standard Eroor of tje Mean values for each column if it's Numeric.

Income        582.327175
Age             2.718251
Experience      2.472066
dtype: float64

#### Grouping 
* Any Groupby Operation involves one of the following operations on the original object. They are :- 

 * Splitting the Object
 * Applying a Function
 * Combining a Results.
 
#### Note:- Value which is used for grouping must be categorical Variable or String Values.

In [340]:
employees = pd.DataFrame({"Name":["Josh","Mike","Julia","Sergio","Julia","Michael","Sarath","Jakub","Chris"],
                          "Department":["IT","Human Resources","Finance","Supply Chain","Finance","Marketing","IT","Human Resources","Law"],
                          "Income":[4800,5200,6600,5700,7200,8400,7700,4200,9400],
                          "Age":[24,28,33,41,22,46,31,27,39],
                          "Experience":[2,5,9,17,1,24,10,6,13]})
employees

      Name       Department  Income  Age  Experience
0     Josh               IT    4800   24           2
1     Mike  Human Resources    5200   28           5
2    Julia          Finance    6600   33           9
3   Sergio     Supply Chain    5700   41          17
4    Julia          Finance    7200   22           1
5  Michael        Marketing    8400   46          24
6   Sarath               IT    7700   31          10
7    Jakub  Human Resources    4200   27           6
8    Chris              Law    9400   39          13

* Departments are Categorical Variables and we can to group employees by their Department. In order to do that,we use groupby() function.

In [347]:
var = employees.groupby("Department") #It will create an object.

In [348]:
var

In [352]:
var.get_group("IT")

     Name Department  Income  Age  Experience
0    Josh         IT    4800   24           2
6  Sarath         IT    7700   31          10

* We can also do that with filtering.

In [353]:
employees[employees["Department"]=="IT"]

     Name Department  Income  Age  Experience
0    Josh         IT    4800   24           2
6  Sarath         IT    7700   31          10

* we can apply a function to the group.

In [354]:
employees.groupby("Department").mean()

                 Income   Age  Experience
Department
Finance          6900.0  27.5         5.0
Human Resources  4700.0  27.5         5.5
IT               6250.0  27.5         6.0
Law              9400.0  39.0        13.0
Marketing        8400.0  46.0        24.0
Supply Chain     5700.0  41.0        17.0

* Here we can see that we are grouping by Department and then finding the mean.

* We can also refine the search to a specific column.

In [355]:
employees.groupby("Department").mean()["Income"]

Department
Finance            6900.0
Human Resources    4700.0
IT                 6250.0
Law                9400.0
Marketing          8400.0
Supply Chain       5700.0
Name: Income, dtype: float64

In [359]:
employees.groupby("Department")["Experience"].sum() #Here we are grouping by based on Department column and summing the
                                                    # Experience.

Department
Finance            10
Human Resources    11
IT                 12
Law                13
Marketing          24
Supply Chain       17
Name: Experience, dtype: int64

In [360]:
employees.groupby("Department")["Age"].describe()

                 count  mean       std   min    25%   50%    75%   max
Department
Finance            2.0  27.5  7.778175  22.0  24.75  27.5  30.25  33.0
Human Resources    2.0  27.5  0.707107  27.0  27.25  27.5  27.75  28.0
IT                 2.0  27.5  4.949747  24.0  25.75  27.5  29.25  31.0
Law                1.0  39.0       NaN  39.0  39.00  39.0  39.00  39.0
Marketing          1.0  46.0       NaN  46.0  46.00  46.0  46.00  46.0
Supply Chain       1.0  41.0       NaN  41.0  41.00  41.0  41.00  41.0

* If we want to apply more than 1 function, we need to use **agg()**. It is same as **aggregate()**.

In [363]:
employees.groupby("Department")["Income"].aggregate(["mean","max"])

                 mean   max
Department
Finance          6900  7200
Human Resources  4700  5200
IT               6250  7700
Law              9400  9400
Marketing        8400  8400
Supply Chain     5700  5700

In [364]:
employees.groupby("Department").aggregate({"Income":"mean","Age":"max"})

                 Income  Age
Department
Finance            6900   33
Human Resources    4700   28
IT                 6250   31
Law                9400   39
Marketing          8400   46
Supply Chain       5700   41

#### Apply :- It applies a specific function all values of a dataframe of series.

* Apply allow the users to pass a function and apply it on every single value of the Pandas series.
* https://www.geeksforgeeks.org/python-pandas-apply/

In [365]:
employees = pd.DataFrame({"Name":["Josh","Mike","Julia","Sergio","Julia","Michael","Sarath","Jakub","Chris"],
                          "Department":["IT","Human Resources","Finance","Supply Chain","Finance","Marketing","IT","Human Resources","Law"],
                          "Income":[4800,5200,6600,5700,7200,8400,7700,4200,9400],
                          "Age":[24,28,33,41,22,46,31,27,39],
                          "Experience":[2,5,9,17,1,24,10,6,13]})
employees

      Name       Department  Income  Age  Experience
0     Josh               IT    4800   24           2
1     Mike  Human Resources    5200   28           5
2    Julia          Finance    6600   33           9
3   Sergio     Supply Chain    5700   41          17
4    Julia          Finance    7200   22           1
5  Michael        Marketing    8400   46          24
6   Sarath               IT    7700   31          10
7    Jakub  Human Resources    4200   27           6
8    Chris              Law    9400   39          13

In [366]:
employees["Name"].apply(len) # Finding the length of Name from Name column.

0    4
1    4
2    5
3    6
4    5
5    7
6    6
7    5
8    5
Name: Name, dtype: int64

In [367]:
def increase_age(x):
    return x+1

In [368]:
# Here we are invreasing the age by 1 
employees["Age"].apply(increase_age)

0    25
1    29
2    34
3    42
4    23
5    47
6    32
7    28
8    40
Name: Age, dtype: int64

In [369]:
employees["Age"].apply(lambda x:x+1) # Another Way of increasing age.

0    25
1    29
2    34
3    42
4    23
5    47
6    32
7    28
8    40
Name: Age, dtype: int64

* Grouping by Department and finding the sum of Income Column.

In [371]:
employees.groupby("Department")["Income"].apply(sum)

Department
Finance            13800
Human Resources     9400
IT                 12500
Law                 9400
Marketing           8400
Supply Chain        5700
Name: Income, dtype: int64

* Grouping by Department and finding the minimum age from the Department.

In [373]:
employees.groupby("Department")["Age"].apply(min)

Department
Finance            22
Human Resources    27
IT                 24
Law                39
Marketing          46
Supply Chain       41
Name: Age, dtype: int64

* We can also use **applymap()** function in order to apply a function a DatFrame Elementwise.

* https://www.geeksforgeeks.org/python-pandas-dataframe-applymap/

In [374]:
employees

      Name       Department  Income  Age  Experience
0     Josh               IT    4800   24           2
1     Mike  Human Resources    5200   28           5
2    Julia          Finance    6600   33           9
3   Sergio     Supply Chain    5700   41          17
4    Julia          Finance    7200   22           1
5  Michael        Marketing    8400   46          24
6   Sarath               IT    7700   31          10
7    Jakub  Human Resources    4200   27           6
8    Chris              Law    9400   39          13

In [375]:
employees[["Name","Department"]].applymap(len)

   Name  Department
0     4           2
1     4          15
2     5           7
3     6          12
4     5           7
5     7           9
6     6           2
7     5          15
8     5           3

* We can also replace IT to Information Technology, Here we will use replace() method.

In [376]:
employees["Department"].replace({"IT":"Information Technology"},inplace = True)

In [377]:
employees

      Name              Department  Income  Age  Experience
0     Josh  Information Technology    4800   24           2
1     Mike         Human Resources    5200   28           5
2    Julia                 Finance    6600   33           9
3   Sergio            Supply Chain    5700   41          17
4    Julia                 Finance    7200   22           1
5  Michael               Marketing    8400   46          24
6   Sarath  Information Technology    7700   31          10
7    Jakub         Human Resources    4200   27           6
8    Chris                     Law    9400   39          13

### Pivot Tables

* It creates a Spreadsheet style pivot table as a DataFrame.
* https://www.analyticsvidhya.com/blog/2020/03/pivot-table-pandas-python/
* https://www.geeksforgeeks.org/python-pandas-pivot_table/

In [378]:
employees

      Name              Department  Income  Age  Experience
0     Josh  Information Technology    4800   24           2
1     Mike         Human Resources    5200   28           5
2    Julia                 Finance    6600   33           9
3   Sergio            Supply Chain    5700   41          17
4    Julia                 Finance    7200   22           1
5  Michael               Marketing    8400   46          24
6   Sarath  Information Technology    7700   31          10
7    Jakub         Human Resources    4200   27           6
8    Chris                     Law    9400   39          13

In [397]:
piv_table = pd.pivot_table(data=employees,index = "Department")

In [398]:
piv_table

                         Age  Experience  Income
Department
Finance                 27.5         5.0    6900
Human Resources         27.5         5.5    4700
Information Technology  27.5         6.0    6250
Law                     39.0        13.0    9400
Marketing               46.0        24.0    8400
Supply Chain            41.0        17.0    5700

In [403]:
employees.pivot_table("Income",index = "Department",columns = "Name")

Name,Chris,Jakub,Josh,Julia,Michael,Mike,Sarath,Sergio
Department,,,,,,,,
Finance,NaN,NaN,NaN,6900.0,NaN,NaN,NaN,NaN
Human Resources,NaN,4200.0,NaN,NaN,NaN,5200.0,NaN,NaN
Information Technology,NaN,NaN,4800.0,NaN,NaN,NaN,7700.0,NaN
Law,9400.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Marketing,NaN,NaN,NaN,NaN,8400.0,NaN,NaN,NaN
Supply Chain,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5700.0

#### Missing Values(NaN)

In [404]:
employees = pd.DataFrame({"Name":["Josh",None,"Julia","Sergio","Julia","Michael","Sarath",np.nan,"Chris"],
                          "Department":["IT","Human Resources","Finance","Supply Chain","Finance","Marketing","IT","Human Resources","Law"],
                          "Work Level":["WL3","WL2","WL2","WL1",None,"WL2","WL1","WL3","WL1"],
                          "Income":[4800,5200,6600,np.nan,7200,8400,np.nan,4200,9400],
                          "Age":[24,28,33,41,22,46,31,None,39],
                          "Experience":[2,np.nan,9,17,1,24,10,6,13]})
employees.head()

     Name       Department Work Level  Income   Age  Experience
0    Josh               IT        WL3  4800.0  24.0         2.0
1    None  Human Resources        WL2  5200.0  28.0         NaN
2   Julia          Finance        WL2  6600.0  33.0         9.0
3  Sergio     Supply Chain        WL1     NaN  41.0        17.0
4   Julia          Finance       None  7200.0  22.0         1.0

Entries missing values are given the value **NaN**, short for "Not a Number". For technical reasons these NaN values are always of the float64 dtype.

Pandas provides some methods specific to missing data. To select NaN entries, we can use pd.isnull().

In [407]:
employees["Income"].isnull() # It returns True if row has any NaN Value.

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
Name: Income, dtype: bool

In [413]:
find_null = employees[employees["Income"].isnull()]

In [414]:
find_null.fillna(employees["Income"].mean()) # We can also give a statistical value. It is better generally.

     Name    Department Work Level       Income   Age  Experience
3  Sergio  Supply Chain        WL1  6542.857143  41.0        17.0
6  Sarath            IT        WL1  6542.857143  31.0        10.0

We can also directly drop missing values with **dropna()** method. But in general, it is not preferred because it delete also information about dataset.

In [415]:
employees

      Name       Department Work Level  Income   Age  Experience
0     Josh               IT        WL3  4800.0  24.0         2.0
1     None  Human Resources        WL2  5200.0  28.0         NaN
2    Julia          Finance        WL2  6600.0  33.0         9.0
3   Sergio     Supply Chain        WL1     NaN  41.0        17.0
4    Julia          Finance       None  7200.0  22.0         1.0
5  Michael        Marketing        WL2  8400.0  46.0        24.0
6   Sarath               IT        WL1     NaN  31.0        10.0
7      NaN  Human Resources        WL3  4200.0   NaN         6.0
8    Chris              Law        WL1  9400.0  39.0        13.0

In [416]:
employees.dropna() # It drops all NaN Values.

      Name Department Work Level  Income   Age  Experience
0     Josh         IT        WL3  4800.0  24.0         2.0
2    Julia    Finance        WL2  6600.0  33.0         9.0
5  Michael  Marketing        WL2  8400.0  46.0        24.0
8    Chris        Law        WL1  9400.0  39.0        13.0

In [418]:
employees.dropna(how="all") # It drops all NaN Values.

      Name       Department Work Level  Income   Age  Experience
0     Josh               IT        WL3  4800.0  24.0         2.0
1     None  Human Resources        WL2  5200.0  28.0         NaN
2    Julia          Finance        WL2  6600.0  33.0         9.0
3   Sergio     Supply Chain        WL1     NaN  41.0        17.0
4    Julia          Finance       None  7200.0  22.0         1.0
5  Michael        Marketing        WL2  8400.0  46.0        24.0
6   Sarath               IT        WL1     NaN  31.0        10.0
7      NaN  Human Resources        WL3  4200.0   NaN         6.0
8    Chris              Law        WL1  9400.0  39.0        13.0

In [420]:
employees.dropna(axis = "columns") # We can drop columns if it has NaN Values.

        Department
0               IT
1  Human Resources
2          Finance
3     Supply Chain
4          Finance
5        Marketing
6               IT
7  Human Resources
8              Law

#### Reading CSV Files
* CSV files contains plain text and is a well know format that can be read by everyone including Pandas.
* https://www.geeksforgeeks.org/working-csv-files-python/

In [421]:
pd.read_csv("L:\Datasets\covid19_Confirmed_dataset.csv")

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,4/21/20,4/22/20,4/23/20,4/24/20,4/25/20,4/26/20,4/27/20,4/28/20,4/29/20,4/30/20
0,NaN,Afghanistan,33.000000,65.000000,0,0,0,0,0,0,...,1092,1176,1279,1351,1463,1531,1703,1828,1939,2171
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,609,634,663,678,712,726,736,750,766,773
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,2811,2910,3007,3127,3256,3382,3517,3649,3848,4006
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,717,723,723,731,738,738,743,743,743,745
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,24,25,25,25,25,26,27,27,27,27
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
261,NaN,Western Sahara,24.215500,-12.885800,0,0,0,0,0,0,...,6,6,6,6,6,6,6,6,6,6
262,NaN,Sao Tome and Principe,0.186360,6.613081,0,0,0,0,0,0,...,4,4,4,4,4,4,4,8,8,14
263,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,1,1,1,1,1,1,1,1,6,6
264,NaN,Comoros,-11.645500,43.333300,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
265,NaN,Tajikistan,38.861034,71.276093,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,15

In [422]:
covid_data = pd.read_csv("L:\Datasets\covid19_Confirmed_dataset.csv")

In [424]:
covid_data.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,4/21/20,4/22/20,4/23/20,4/24/20,4/25/20,4/26/20,4/27/20,4/28/20,4/29/20,4/30/20
0,NaN,Afghanistan,33.0000,65.0000,0,0,0,0,0,0,...,1092,1176,1279,1351,1463,1531,1703,1828,1939,2171
1,NaN,Albania,41.1533,20.1683,0,0,0,0,0,0,...,609,634,663,678,712,726,736,750,766,773
2,NaN,Algeria,28.0339,1.6596,0,0,0,0,0,0,...,2811,2910,3007,3127,3256,3382,3517,3649,3848,4006
3,NaN,Andorra,42.5063,1.5218,0,0,0,0,0,0,...,717,723,723,731,738,738,743,743,743,745
4,NaN,Angola,-11.2027,17.8739,0,0,0,0,0,0,...,24,25,25,25,25,26,27,27,27,27